test/performance/performance_nginx.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.19.10
Server Hostname:        localhost
Server Port:            4000

Document Path:          /
Document Length:        26 bytes

Concurrency Level:      500
Time taken for tests:   1.695 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2560000 bytes
HTML transferred:       260000 bytes
Requests per second:    5898.56 [#/sec] (mean)
Time per request:       84.766 [ms] (mean)
Time per request:       0.170 [ms] (mean, across all concurrent requests)
Transfer rate:          1474.64 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.8      0      10
Processing:    11   81  10.4     82     107
Waiting:        1   81  10.3     82     106
Total:         11   82   9.2     82     107

Percentage of the requests served within a certain time (ms)
  50%     82
  66%     85
  75%     88
  80%     89
  90%     93
  95%     96
  98%     98
  99%    100
 100%    107 (longest request)